app/controllers/articulos_controller.rb

  def index
    @articulos = Articulo.all
---
SELECT "articulos".* FROM "articulos"

  def create
    @articulo = Articulo.new(articulo_params)

    respond_to do |format|
      if @articulo.save
---
INSERT INTO "articulos" ("titulo", "subtitulo", "cuerpo", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["titulo", "Este es un articulo"], ["subtitulo", "esta muy bueno"], ["cuerpo", "bla bla bla"], ["created_at", "2017-01-24 23:36:04.331336"], ["updated_at", "2017-01-24 23:36:04.331336"]]

  def update
    respond_to do |format|
      if @articulo.update(articulo_params)
---
UPDATE "articulos" SET "titulo" = $1, "subtitulo" = $2, "updated_at" = $3 WHERE "articulos"."id" = $4  [["titulo", "Nuevo Titulo"], ["subtitulo", "Subtituo"], ["updated_at", "2017-02-11 22:59:47.226564"], ["id", 4]]

  def destroy
    @articulo.destroy
---
DELETE FROM "articulos" WHERE "articulos"."id" = $1  [["id", 5]]

    def set_articulo
      @articulo = Articulo.find(params[:id])
---
SELECT  "articulos".* FROM "articulos" WHERE "articulos"."id" = $1 LIMIT 1  [["id", 5]]