app/controllers/comentarios_controller.rb

INSERT INTO "comentarios" ("autor", "cuerpo", "articulo_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["autor", "Peyu"], ["cuerpo", "prueba de comentario"], ["articulo_id", 4], ["created_at", "2017-02-10 20:43:14.033511"], ["updated_at", "2017-02-10 20:43:14.033511"]]
---
  def create
    @comentario = @articulo.comentarios.new(comentario_params)
    if @comentario.save

SELECT  "articulos".* FROM "articulos" WHERE "articulos"."id" = $1 LIMIT 1  [["id", 4]]
---
    def set_articulo
      @articulo = Articulo.find(params[:articulo_id])