app/controllers/eventos_controller.rb

  def index
    @eventos = Evento.all
---
SELECT "eventos".* FROM "eventos"  ORDER BY created_at DESC OFFSET 3

  def create
    @evento = Evento.new(evento_params)

    respond_to do |format|
      if @evento.save
---
INSERT INTO "eventos" ("imagen", "titulo", "cuerpo", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update
    respond_to do |format|
      if @evento.update(evento_params)
---
UPDATE "eventos" SET "imagen" = $1, "updated_at" = $2 WHERE "eventos"."id" = $3  [["imagen", "yamanishi_-_1ra.jpg"], ["updated_at", "2017-02-17 19:19:50.104878"], ["id", 3]]

    def set_evento
      @evento = Evento.find(params[:id])
---
SELECT  "eventos".* FROM "eventos" WHERE "eventos"."id" = $1 LIMIT 1  [["id", 3]]