app/controllers/sessions_controller.rb

  def create
    usuario = Usuario.find_by(nombre: params[:usuario][:nombre])
---
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."nombre" = $1 LIMIT 1  [["nombre", "Peyu"]]