app/views/articulos/show.html.erb

SELECT "comentarios".* FROM "comentarios" WHERE "comentarios"."articulo_id" = $1  [["articulo_id", 4]]
SELECT COUNT(*) FROM "comentarios" WHERE "comentarios"."articulo_id" = $1  [["articulo_id", 5]]
---
        <div class="page-header">
          <h1><small class="pull-right"> <%= pluralize(@articulo.comentarios.count, "comentario") %></small> Comentarios </h1>